TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
#include <msp430.h>
#include <msp430fr2476.h>
#include <stdio.h>
#include <string.h>
#include "sensor-library.h"

#define SDA_PIN BIT2
#define SCL_PIN BIT3
#define SDA BIT2
#define SCL BIT3

#define DEBUG false

extern void uart_write_string(const char *str);
extern void uart_write_int(int num);
extern void delay_ms(uint16_t ms);

// setting the reset & mfio pins
SparkFun_Bio_Sensor_Hub::SparkFun_Bio_Sensor_Hub(volatile uint8_t* resetPort, volatile uint8_t* resetOut, uint16_t resetBit,
                                                 volatile uint8_t* mfioPort, volatile uint8_t* mfioOut, volatile uint8_t* mfioRen, uint16_t mfioBit,
                                                 uint8_t address)
{

    // set the necessary pins
    _resetPort = resetPort;
    _resetOut = resetOut;
    _resetBit = resetBit;

    _mfioPort = mfioPort;
    _mfioOut = mfioOut;
    _mfioRen = mfioRen;
    _mfioBit = mfioBit;

    _address = address;

    if (_resetPort != nullptr)
    {
        *_resetPort |= _resetBit; // set direction to output
        *_resetOut |= _resetBit;  // set pin high
    }

    if (_mfioPort != nullptr)
    {
        *_mfioPort |= _mfioBit; // set direction to output
        *_mfioOut |= _mfioBit;  // set pin high
    }
}

// initializes sensor
// to do this, place sensor into application mode by pulling MFIO high
// while board is in reset
uint8_t SparkFun_Bio_Sensor_Hub::begin()
{
    // validate that pins ARE assigned
    if (_resetPort == nullptr || _mfioPort == nullptr) return ERR_UNKNOWN;

    *_mfioOut |= _mfioBit;    // set mfio high
    *_resetOut &= ~_resetBit; // set reset low
    delay_ms(10);

    *_resetOut |= _resetBit; // set reset high
    delay_ms(1000);

    // set mfio to input
    *_mfioPort &= ~_mfioBit;
    *_mfioRen |= _mfioBit;
    *_mfioOut |= _mfioBit;

    return readByte(READ_DEVICE_MODE, 0x00); // verify sensor returns 0x00 (application)
}

// places sensor in bootloader mode
// to do this, pull MFIO low while board is in reset
uint8_t SparkFun_Bio_Sensor_Hub::beginBootloader()
{
    // validate that pins ARE assigned
    if (_resetPort == nullptr || _mfioPort == nullptr) return ERR_UNKNOWN;

    *_mfioOut &= ~_mfioBit;   // set mfio low
    *_resetOut &= ~_resetBit; // set reset low
    delay_ms(10);

    *_resetOut |= _resetBit; // set reset high
    delay_ms(50);

    *_mfioOut |= _mfioBit; // set mfio high

    return readByte(READ_DEVICE_MODE, 0x00); // verify sensor returned 0x08 (bootloader)
}

// checks the status of the FIFO
uint8_t SparkFun_Bio_Sensor_Hub::readSensorHubStatus()
{
    return readByte(HUB_STATUS, 0x00);
}

// alternate way to set mode of sensor (implemented as the github has)
uint8_t SparkFun_Bio_Sensor_Hub::setOperatingMode(uint8_t selection)
{
    // parameter validation (must be 0x00, 0x02, or 0x08)
    if (selection != EXIT_BOOTLOADER && selection != SFE_BIO_RESET && selection != ENTER_BOOTLOADER) return INCORR_PARAM;

    // send mode change
    uint8_t statusByte = writeByte(SET_DEVICE_MODE, 0x00, selection);
    if (statusByte != SFE_BIO_SUCCESS) return statusByte;

    return readByte(READ_DEVICE_MODE, 0x00); // read device mode (either 0x00 or 0x08 should be returned)
}

// sets basic settings to get sensor & biometric data
// those being: heartrate, confidence, Sp02, and if a finger is detected
uint8_t SparkFun_Bio_Sensor_Hub::configBpm(uint8_t mode)
{

    if (mode != MODE_ONE && mode != MODE_TWO) return ERR_TRY_AGAIN; // make sure we selected a valid mode

    uint8_t status;

    status = setOutputMode(ALGO_DATA); // set the output mode to only data
    if (status != SFE_BIO_SUCCESS) return status;

    status = setFifoThreshold(0x01); // one sample before interrupt is fired
    if (status != SFE_BIO_SUCCESS) return status;

    status = agcAlgoControl(ENABLE); // one sample before interrupt is fired
    if (status != SFE_BIO_SUCCESS) return status;

    status = max30101Control(ENABLE); // enable control
    if (status != SFE_BIO_SUCCESS) return status;

    status = maximFastAlgoControl(mode); // set the algo mode to our choice
    if (status != SFE_BIO_SUCCESS) return status;

    _userSelectedMode = mode;
    _sampleRate = readAlgoSamples();

    delay_ms(1000); // 1 second delay
    return SFE_BIO_SUCCESS;
}

// sets basic settings to get LED counts from MAX30101
uint8_t SparkFun_Bio_Sensor_Hub::configSensor()
{
    uint8_t status;

    status = setOutputMode(SENSOR_DATA); // set to sensor data
    if (status != SFE_BIO_SUCCESS) return status;

    status = setFifoThreshold(0x01); // one sample before interrupt is fired to MAX32664
    if (status != SFE_BIO_SUCCESS) return status;

    status = max30101Control(ENABLE); // enable sensor
    if (status != SFE_BIO_SUCCESS) return status;

    status = maximFastAlgoControl(MODE_ONE); // enable algorithm
    if (status != SFE_BIO_SUCCESS) return status;

    delay_ms(1000);
    return SFE_BIO_SUCCESS;
}

// configure both sensor & biometric data
uint8_t SparkFun_Bio_Sensor_Hub::configSensorBpm(uint8_t mode)
{

    if (mode != MODE_ONE && mode != MODE_TWO) return ERR_TRY_AGAIN; // ensure a correct mode was selected

    uint8_t status;

    status = setOutputMode(SENSOR_AND_ALGORITHM); // set data & sensor data
    if (status != SFE_BIO_SUCCESS) return status;

    status = setFifoThreshold(0x01); // one sample before interrupt is fired
    if (status != SFE_BIO_SUCCESS) return status;

    status = max30101Control(ENABLE); // enable sensor
    if (status != SFE_BIO_SUCCESS) return status;

    status = maximFastAlgoControl(mode); // enable algorithm
    if (status != SFE_BIO_SUCCESS) return status;

    _userSelectedMode = mode;
    _sampleRate = readAlgoSamples();

    delay_ms(1000);
    return SFE_BIO_SUCCESS;
}

// takes 8 bytes from FIFO buffer: 
// heart rate (uint16_t), confidence (uint8_t), Sp02 (uint16_t), status (uint8_t)
bioData SparkFun_Bio_Sensor_Hub::readBpm()
{
    bioData libBpm;
    uint8_t status = readSensorHubStatus(); // returns 0 if no error

