TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
    // if we get a communication error
    if (status == 1)
    {
        libBpm.heartRate = 0;
        libBpm.confidence = 0;
        libBpm.oxygen = 0;
        return libBpm;
    }

    numSamplesOutFifo();

    if (_userSelectedMode == MODE_ONE)
    {
        status = readFillArray(READ_DATA_OUTPUT, READ_DATA, MAXFAST_ARRAY_SIZE, bpmArr);
        if (status != SFE_BIO_SUCCESS)
        {
            libBpm.heartRate = 0;
            libBpm.confidence = 0;
            libBpm.oxygen = 0;
            return libBpm;
        }

        // heart rate formatting
        libBpm.heartRate = ((uint16_t(bpmArr[0]) << 8) | bpmArr[1]) / 10;

        // confidence formatting
        libBpm.confidence = bpmArr[2];

        // blood oxygen level formatting
        libBpm.oxygen = ((uint16_t(bpmArr[3]) << 8) | bpmArr[4]) / 10;

        // has a finger been detected?
        libBpm.status = bpmArr[5];

        return libBpm;
    }
    else if (_userSelectedMode == MODE_TWO)
    {
        status = readFillArray(READ_DATA_OUTPUT, READ_DATA, MAXFAST_ARRAY_SIZE + MAXFAST_EXTENDED_DATA, bpmArrTwo);
        if (status != SFE_BIO_SUCCESS)
        {
            libBpm.heartRate = 0;
            libBpm.confidence = 0;
            libBpm.oxygen = 0;
            return libBpm;
        }

        // heart rate formatting
        libBpm.heartRate = ((uint16_t(bpmArrTwo[0]) << 8) | bpmArrTwo[1]) / 10;

        // confidence formatting
        libBpm.confidence = bpmArrTwo[2];

        // blood oxygen level formatting
        libBpm.oxygen = ((uint16_t(bpmArrTwo[3]) << 8) | bpmArrTwo[4]) / 10;

        // has a finger been detected?
        libBpm.status = bpmArrTwo[5];

        // Sp02 r value formatting
        // uint16_t tempVal = (uint16_t(bpmArrTwo[6]) << 8) | bpmArrTwo[7];
        // libBpm.rValue = tempVal;
        // libBpm.rValue /= 10.0;
        libBpm.rValue = ((uint16_t(bpmArrTwo[6]) << 8) | bpmArrTwo[7]) / 10;

        // extended machine state formatting
        libBpm.extStatus = bpmArrTwo[8];

        // two additional bytes of data were requested, but not implemented
        // with the sensor version we have
        return libBpm;
    }
    else
    {
        libBpm.heartRate = 0;
        libBpm.confidence = 0;
        libBpm.oxygen = 0;
        return libBpm;
    }

    return libBpm;
}

// takes 9 bytes of the LED values (IR, RED, GREEN)
bioData SparkFun_Bio_Sensor_Hub::readSensor()
{
    bioData libLedFifo;

    uint8_t status = readFillArray(READ_DATA_OUTPUT, READ_DATA, MAX30101_LED_ARRAY, senArr);

    if (status != SFE_BIO_SUCCESS) return libLedFifo;

    // format IR LED values
    libLedFifo.irLed = (uint32_t)senArr[0] << 16;
    libLedFifo.irLed |= (uint32_t)senArr[1] << 8;
    libLedFifo.irLed |= (uint32_t)senArr[2];

    // format red LED values
    libLedFifo.redLed = (uint32_t)senArr[3] << 16;
    libLedFifo.redLed |= (uint32_t)senArr[4] << 8;
    libLedFifo.redLed |= (uint32_t)senArr[5];

    // format green LED values
    libLedFifo.greenLed = (uint32_t)senArr[6] << 16;
    libLedFifo.greenLed |= (uint32_t)senArr[7] << 8;
    libLedFifo.greenLed |= (uint32_t)senArr[8];

    return libLedFifo;
}

// combines read sensor & read bpm (need to debug)
bioData SparkFun_Bio_Sensor_Hub::readSensorBpm()
{
    bioData libLedBpm;
    uint8_t status;

    if (_userSelectedMode == MODE_ONE)
    {
        status = readFillArray(READ_DATA_OUTPUT, READ_DATA, MAXFAST_ARRAY_SIZE + MAX30101_LED_ARRAY, bpmSenArr);
        if (status != SFE_BIO_SUCCESS) return libLedBpm;

        // format IR LED values
        libLedBpm.irLed = (uint32_t)bpmSenArr[0] << 16;
        libLedBpm.irLed |= (uint32_t)bpmSenArr[1] << 8;
        libLedBpm.irLed |= (uint32_t)bpmSenArr[2];

        // format red LED values
        libLedBpm.redLed = (uint32_t)bpmSenArr[3] << 16;
        libLedBpm.redLed |= (uint32_t)bpmSenArr[4] << 8;
        libLedBpm.redLed |= (uint32_t)bpmSenArr[5];

        // heart rate formatting
        libLedBpm.heartRate = ((uint16_t(bpmSenArr[12]) << 8) | bpmSenArr[13]) / 10;

        // confidence formatting
        libLedBpm.confidence = bpmSenArr[14];

        // blood oxygen level formatting
        libLedBpm.oxygen = ((uint16_t(bpmSenArr[15]) << 8) | bpmSenArr[16]) / 10;

        // "machine state" - has a finger been detected?
        libLedBpm.status = bpmSenArr[17];

        return libLedBpm;
    }
    else if (_userSelectedMode == MODE_TWO)
    {
        status = readFillArray(READ_DATA_OUTPUT, READ_DATA, MAXFAST_ARRAY_SIZE + MAX30101_LED_ARRAY + MAXFAST_EXTENDED_DATA, bpmSenArrTwo);
        if (status != SFE_BIO_SUCCESS) return libLedBpm;

        // format IR LED values
        libLedBpm.irLed = (uint32_t)bpmSenArrTwo[0] << 16;
        libLedBpm.irLed |= (uint32_t)bpmSenArrTwo[1] << 8;
        libLedBpm.irLed |= (uint32_t)bpmSenArrTwo[2];

        // format red LED values
        libLedBpm.redLed = (uint32_t)bpmSenArrTwo[3] << 16;
        libLedBpm.redLed |= (uint32_t)bpmSenArrTwo[4] << 8;
        libLedBpm.redLed |= (uint32_t)bpmSenArrTwo[5];

        // heart rate formatting
        libLedBpm.heartRate = ((uint16_t(bpmSenArrTwo[12]) << 8) | bpmSenArrTwo[13]) / 10;

        // confidence formatting
        libLedBpm.confidence = bpmSenArrTwo[14];

        // blood oxygen level formatting
        libLedBpm.oxygen = ((uint16_t(bpmSenArrTwo[15]) << 8) | bpmSenArrTwo[16]) / 10;

        // "machine state" - has a finger been detected?
        libLedBpm.status = bpmSenArrTwo[17];

        // Sp02 r value formatting
        uint16_t tempVal = (uint16_t(bpmSenArrTwo[18]) << 8) | bpmSenArrTwo[19];
        libLedBpm.rValue = tempVal;
        libLedBpm.rValue /= 10.0;

        // extended machine state formatting
        libLedBpm.extStatus = bpmSenArrTwo[20];

        // two additional bytes of data were requested, but not implemented
        return libLedBpm;
    }
    else
    {
        libLedBpm.irLed = 0;
        libLedBpm.redLed = 0;
        libLedBpm.heartRate = 0;
        libLedBpm.confidence = 0;
        libLedBpm.oxygen = 0;
        libLedBpm.status = 0;
        libLedBpm.rValue = 0;
        libLedBpm.extStatus = 0;
        return libLedBpm;
    }

    return libLedBpm;
}

// modifies the pulse width of the MAX30101 LEDs
uint8_t SparkFun_Bio_Sensor_Hub::setPulseWidth(uint16_t width)
{
    uint8_t bits, regVal;

    switch(width)
    {
        case 69:    bits = 0; break;    // fastest, least resolution
        case 118:   bits = 1; break;
        case 215:   bits = 2; break;
        case 411:   bits = 3; break;    // slowest, highest resolution
        default:    return INCORR_PARAM;
    }

    // get current register value to not overwrite anything
    regVal = readRegisterMAX30101(CONFIGURATION_REGISTER);
    regVal &= PULSE_MASK; // mask bits to change
    regVal |= bits;       // add bits

