TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    UCB0TXBUF = _familyByte;

    while(!(UCB0IFG & UCTXIFG));

    UCB0TXBUF = _indexByte;

    while(!(UCB0IFG & UCTXIFG));

    UCB0TXBUF = _writeByte;

    while(!(UCB0IFG & UCTXIFG));

    UCB0CTLW0 |= UCTXSTP;

    while(UCB0CTLW0 & UCTXSTP);

    delay_ms(6);

    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    while(!(UCB0IFG & UCRXIFG));

    statusByte = UCB0RXBUF;

    if(statusByte != SFE_BIO_SUCCESS)
    {
        UCB0CTLW0 |= UCTXSTP;

        while(!(UCB0IFG & UCRXIFG));

        uint8_t dummy = UCB0RXBUF;

        while(UCB0CTLW0 & UCTXSTP);

        return statusByte;
    }

    while(!(UCB0IFG & UCRXIFG));

    returnByte = (uint16_t)(UCB0RXBUF << 8);

    UCB0CTLW0 |= UCTXSTP;

    while(!(UCB0IFG & UCRXIFG));

    returnByte |= UCB0RXBUF;

    while(UCB0CTLW0 & UCTXSTP);
    
    return returnByte;
}

// reads the bytes in an arr
uint8_t SparkFun_Bio_Sensor_Hub::readMultipleBytes(uint8_t _familyByte, uint8_t _indexByte, const size_t _len, uint8_t userArray[])
{
    uint8_t statusByte;

    //// START A WRITE ////
    UCB0I2CSA = this->_address;

    // set to transmitter mode & start condition
    UCB0CTLW0 |= UCTR | UCTXSTT;

    // check to make sure we got a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    // set buffer to family byte
    UCB0TXBUF = _familyByte;

    // wait for transmit to complete
    while(!(UCB0IFG & UCTXIFG));

    // set the buffer to index byte
    UCB0TXBUF = _indexByte;

    // wait for transmit to complete
    while(!(UCB0IFG & UCTXIFG));

    // send the stop signal
    UCB0CTLW0 |= UCTXSTP;

    // wait until stop condition is true
    while(UCB0CTLW0 & UCTXSTP);

    // wait for 6 ms
    delay_ms(6);

    //// START A READ ////

    // set UCTR to 0 & start condition
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    // check to make sure we got a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    // wait for receive interrupt
    while(!(UCB0IFG & UCRXIFG));

    // set status byte to the interrupt
    statusByte = UCB0RXBUF;

    // check the status byte

    if(statusByte != SFE_BIO_SUCCESS)
    {
        // stop transmission
        UCB0CTLW0 |= UCTXSTP;

        // since we read the buffer, we automatically ACK'd for another buffer read
        // flush the buffer
        while(!(UCB0IFG & UCRXIFG));

        // create a dummy value to read the buffer
        uint8_t dummy = UCB0RXBUF;

        // wait for stop
        while(UCB0CTLW0 & UCTXSTP);

        return statusByte;
    }

    // loop for len indexes (i is set to size_t to match _len type)
    for(size_t i = 0; i != _len; i++)
    {
        // send the stop when we are at the last index (ex: length of 3's last index is 2)
        if(i == (_len - 1))
        {
            UCB0CTLW0 |= UCTXSTP;
        }

        // wait until we are good to read
        while(!(UCB0IFG & UCRXIFG));

        // set the array index to the buffer value
        userArray[i] = UCB0RXBUF;
    }

    // wait for stop to finish
    while(UCB0CTLW0 & UCTXSTP);

    // we already checked if status byte was good
    return statusByte;
}

// same as above, but also adds a write byte
uint8_t SparkFun_Bio_Sensor_Hub::readMultipleBytes(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, const size_t _len, uint8_t userArray[])
{

    uint8_t statusByte;

    // write the three bytes
    UCB0I2CSA = this->_address;
    
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    UCB0TXBUF = _familyByte;

    while(!(UCB0IFG & UCTXIFG));

    UCB0TXBUF = _indexByte;

    while(!(UCB0IFG & UCTXIFG));

    UCB0TXBUF = _writeByte;

    while(!(UCB0IFG & UCTXIFG));

    UCB0CTLW0 |= UCTXSTP;

    while(UCB0CTLW0 & UCTXSTP);

    delay_ms(6);

    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    while(!(UCB0IFG & UCRXIFG));

    statusByte = UCB0RXBUF;

    if(statusByte != SFE_BIO_SUCCESS)
    {
        UCB0CTLW0 |= UCTXSTP;

        while(!(UCB0IFG & UCRXIFG));

        uint8_t dummy = UCB0RXBUF;

        while(UCB0CTLW0 & UCTXSTP);

        return statusByte;
    }
    
    for (size_t i = 0; i != _len; i++)
    {
        if(i == (_len - 1))
        {
            UCB0CTLW0 |= UCTXSTP;
        }
        // wait until we are good to read
        while(!(UCB0IFG & UCRXIFG));

        // set the array index to the buffer value
        userArray[i] = UCB0RXBUF;
    }
    
    while(UCB0CTLW0 & UCTXSTP);

    return statusByte;
}

// same as above, but user array is of uint32_t
uint8_t SparkFun_Bio_Sensor_Hub::readMultipleBytes(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, const size_t _len, int32_t userArray[])
{

    uint8_t statusByte;

    // write the three bytes
    UCB0I2CSA = this->_address;
    
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    UCB0TXBUF = _familyByte;

    while(!(UCB0IFG & UCTXIFG));

    UCB0TXBUF = _indexByte;

    while(!(UCB0IFG & UCTXIFG));

    UCB0TXBUF = _writeByte;

    while(!(UCB0IFG & UCTXIFG));

