TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
    UCB0CTLW0 |= UCTXSTP;

    while(UCB0CTLW0 & UCTXSTP);

    delay_ms(6);

    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    while(!(UCB0IFG & UCRXIFG));

    statusByte = UCB0RXBUF;

    if(statusByte != SFE_BIO_SUCCESS)
    {
        UCB0CTLW0 |= UCTXSTP;

        while(!(UCB0IFG & UCRXIFG));

        uint8_t dummy = UCB0RXBUF;

        while(UCB0CTLW0 & UCTXSTP);

        return statusByte;
    }
    
    for (size_t i = 0; i != _len; i++)
    {
        // we set to 0 to allow OR logic later
        userArray[i] = 0;

        for(int8_t shift_by = 24; shift_by != -8; shift_by -= 8)
        {
            // send the stop condition
            if(i == (_len - 1) && shift_by == 0)
            {
                UCB0CTLW0 |= UCTXSTP;
            }
            
            while(!(UCB0IFG & UCRXIFG));

            userArray[i] = ((uint32_t)UCB0RXBUF << shift_by);
        }

    }
    
    while(UCB0CTLW0 & UCTXSTP);

    return statusByte;
}

// write to an array passed through
uint8_t SparkFun_Bio_Sensor_Hub::readFillArray(uint8_t _familyByte, uint8_t _indexByte, uint8_t arraySize, uint8_t array[])
{

    if(arraySize == 0) return ERR_UNKNOWN;

    uint8_t statusByte;

    UCB0I2CSA = this->_address;

    UCB0CTLW0 |= UCTR | UCTXSTT;

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }
    
    UCB0TXBUF = _familyByte;

    while(!(UCB0IFG & UCTXIFG));

    UCB0TXBUF = _indexByte;

    while(!(UCB0IFG & UCTXIFG));

    UCB0CTLW0 |= UCTXSTP;

    while(UCB0CTLW0 & UCTXSTP);

    delay_ms(6);

    // read response
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    while(!(UCB0IFG & UCRXIFG));

    statusByte = UCB0RXBUF;

    if(statusByte != SFE_BIO_SUCCESS)
    {
        UCB0CTLW0 |= UCTXSTP;

        while(!(UCB0IFG & UCRXIFG));

        uint8_t dummy = UCB0RXBUF;

        while(UCB0CTLW0 & UCTXSTP);

        return statusByte;
    }

    for (uint8_t i = 0; i != arraySize; i++)
    {
        if (i == (arraySize - 1))
        {
            UCB0CTLW0 |= UCTXSTP;
        }

        while(!(UCB0IFG & UCRXIFG));
        
        array[i] = UCB0RXBUF;
    }

    while(UCB0CTLW0 & UCTXSTP);

    return statusByte;
}

void delay_ms(uint16_t ms)
{
    // set up timer B0
    // TBSSEL__ACLK for 32kHz clock
    // MC__UP count up
    // ID__1 clock divider = 1
    TB0CTL = TBSSEL__ACLK | MC__UP | ID__1 | TBCLR;

    // set the count value
    // with a 32kHz clock, we do about 32 counts per ms
    TB0CCR0 = 33 * ms;

    // clear the timer interrupt
    TB0CCTL0 &= ~CCIFG;

    // enable clock interrupt
    TB0CCTL0 |= CCIE;

    // enable low power mode & interrupts
    __bis_SR_register(LPM3_bits + GIE);

    // disable timer after we wake
    TB0CTL = MC__STOP;
}

#pragma vector = TIMER0_B0_VECTOR;
__interrupt void Timer_B0_ISR(void)
{
    // wake CPU & exit low-power
    __bic_SR_register_on_exit(LPM3_bits);
}

// creating UART for debugging since printing doesn't seem to work
void initUART()
{
    // configure uart pins, 1.4 = TX & 1.5 = RX
    P1SEL0 |= BIT4 | BIT5;

    // configure uart for 9600 baud
    UCA0CTLW0 |= UCSWRST;       // eUSCI in reset
    UCA0CTLW0 |= UCSSEL__SMCLK; // choose smclk

    UCA0BR0 = 8;
    UCA0BR1 = 0x00;
    UCA0MCTLW = 0xD600;

    UCA0CTLW0 &= ~UCSWRST; // release from reset
}

void uart_write_char(char c)
{
    while (!(UCA0IFG & UCTXIFG)); // wait for tx buffer to be empty
    UCA0TXBUF = c;
}

void uart_write_string(const char *str)
{
    while (*str)
    {
        if (*str == '\n') uart_write_char('\r');
        uart_write_char(*str++);
    }
}

void uart_write_int(int num)
{
    char buf[10];
    int i = 0;
    if (num == 0)
    {
        uart_write_char('0');
        return;
    }
    while (num > 0 && i < 10)
    {
        buf[i++] = (num % 10) + '0';
        num /= 10;
    }
    while (--i >= 0)
    {
        uart_write_char(buf[i]);
    }
}

// \x1B = ESC, ESC [2J clears the screen, ESC [H moves cursor to top left
void uart_clear_screen()
{
    uart_write_string("\x1B[2J\x1B[H"); 
}

uint8_t runI2CScanner() {

    uart_write_string("Hardware Scan Starting...\r\n");
    for (uint8_t addr = 1; addr < 127; addr++)
    {
        UCB0I2CSA = addr;
        UCB0CTLW0 |= UCTR | UCTXSTT; // start & write

        uint32_t timeout = 5000;
        while ((UCB0CTLW0 & UCTXSTT) && --timeout); // Wait for Address

        // bus is stuck
        if (timeout == 0)
        {
            UCB0CTLW0 |= UCSWRST;
            UCB0CTLW0 &= ~UCSWRST;
            continue;
        }

        // device ACK'd
        if (!(UCB0IFG & UCNACKIFG))
        {
            uart_write_string("Found i2c device at: ");
            uart_write_int(addr);
            uart_write_string("\r\n");

            // stop communication & return
            UCB0CTLW0 |= UCTXSTP;

            uint32_t stopTimeout = 1000;
            while((UCB0CTLW0 & UCTXSTP) && --stopTimeout);

            UCB0IFG &= ~UCNACKIFG;

            if(stopTimeout == 0)
            {
                UCB0CTLW0 |= UCSWRST;
                UCB0CTLW0 &= ~UCSWRST;
            }

            return 1;
        }

        UCB0CTLW0 |= UCTXSTP;      // Always send STOP to release bus
        while (UCB0CTLW0 & UCTXSTP);
        UCB0IFG &= ~UCNACKIFG;     // Clear NACK flag for next loop
    }

    return 0;
}

int main(void)
{
    // stop watchdog & gpio high-impedance
    WDTCTL = WDTPW | WDTHOLD;
    PM5CTL0 &= ~LOCKLPM5;

    // init uart
    initUART();
    uart_clear_screen();    // clear the screen so we can properly see all the messages
    delay_ms(100);          // wait a little bit
    uart_write_string("\r\n--- SYSTEM STARTUP ---\n");

    // ensure i2c lines are high
    P1SEL0 &= ~(BIT2 | BIT3);
    P1SEL1 &= ~(BIT2 | BIT3);
    P1DIR &= ~(BIT2 | BIT3); // inputs
    P1REN &= ~(BIT2 | BIT3); // external resistors

